<script setup></script>

<template>
  <div class="about-me">
    <p>
      臺北大學碩士畢業後，我於2018年9月至2019年3月期間參加了資策會的前端班培訓，並順利完成課程。這段培訓經驗不僅增加了我的專業知識，還為我開啟了轉職之門。
      <br /><br />目前，我擁有4-5年的工作經驗，曾經在多家知名企業工作，包括雲鼎科技、緯創軟體以及大樹藥局，積累了豐富的專業技能和實戰經驗。
      在之前的職業生涯中，我扮演了不同的角色，這讓我有機會學習和應用多種技術和工具，以滿足不同行業的需求。<br /><br />在雲鼎科技，我參與了一個重要的專案，負責前端開發，這讓我深入了解了如何建立具有高度可用性和優化性能的網站。在緯創軟體，我負責協助開發軟體解決方案，並與跨國團隊密切合作，提供全球客戶的支援。而在大樹藥局，我負責開發和維護他們的會員系統平台和公司UI元件庫，並積極參與用戶體驗的改進。
      <br /><br />目前，我正在星宇航空擔任職位，這是一個高度挑戰性的領域，要求高度的技術專業知識以確保組員相關系統的迭代和優化。在這個職位上，我不僅將之前的技術知識應用到實際環境中，還不斷學習和成長，以應對不斷變化的需求和挑戰。
      總的來說，我對於前端開發和軟體工程有著深厚的興趣和熱情，並且致力於不斷提升自己的技能，以滿足不同行業的需求。我期待能夠在未來的職業生涯中繼續挑戰自己，並為公司的成功盡一份微薄之力。
    </p>
    <img src="../public/images/me.jpg" alt="" />
  </div>
</template>

<style>
.about-me {
  width: 100%;
  padding: 15px 0;
  color: #444;
  display: flex;
  gap: 20px;
}

.about-me p {
  /* flex-grow: 2; */
  margin-top: 0;
  word-wrap: break-word;
}

.about-me img {
  display: block;
  width: 140px;
  height: 140px;
  border-radius: 9999px;
}

@media screen and (max-width: 640px) {
  .about-me img {
    display: none;
  }
}
</style>
